<!DOCTYPE HTML> 
<html lang="el"> 
    <head>
        <meta http-equiv="Content-type" content="text/html; charset=utf-8" />
        <title>Εργασίες - Ανάπτυξη Web Εφαρμογών</title> 
        <style type="text/css">
            body {
                background-image: url( 'images/assignments-bg.jpg' );
                color: #d0c5c0;
                font-family: Georgia, 'Gill Sans', 'Gill Sans MT', sanf-serif;
                padding-left: 10px;
            }
            p {
                font-size: 13px;
                padding-left: 15px;
            }
            a {
                color: #4f9bdc;
            }
            a.firefox {
                background-image: url( 'images/firefox.png' );
            }
            a.filezilla {
                background-image: url( 'images/filezilla.png' );
            }
            a.icon {
                background-position: 1px 1px;
                padding-left: 20px;
                background-repeat: no-repeat;
            }
            a:hover {
                background-color: #4f9bdc;
                color: white;
                text-decoration: none;
            }
            h1#heading {
                padding-top: 15px;
            }
            a.back {
                position: absolute;
                top: 5px;
                right: 5px;
                padding: 5px 5px 5px 23px;
                background-image: url( 'images/home inverted icon.png' );
                background-repeat: no-repeat;
                background-position: left;
                text-decoration: none;
                font-size: 90%;
                color: white;
            }
            a.back:hover {
                background-color: transparent;
            }
            h1, h2, h3, h4 {
                font: normal 36px/36px Georgia, 'Gill Sans', 'Gill Sans MT', sanf-serif;
                color: white;
            }
            h1 {
                font-size: 28px;
            }
            h2 {
                font-size: 21px;
                border: 1px solid #362f23;
                border-top: 1px solid #4f4b49;
                background-color: #221c10;
                padding-left: 10px;
                -moz-border-radius: 5px;
                border-radius: 5px;
            }
            h3 {
                font-size: 15px;
                padding: 0 0 0 15px;
                margin: 0;
            }
            div#main {
                padding-left: 150px;
                background-image: url( 'images/pencil_cup.png' );
                background-repeat: no-repeat;
                background-position: 0px bottom;
            }
            strong {
                color: white;
            }
            h2 span {
                float: right;
                padding-right: 10px;
                font-size: 75%;
                color: #d0c5c0;
            }
            ul {
                margin: 0;
            }
        </style>
        <script type="text/javascript">
            var _gaq = _gaq || [];
            _gaq.push(['_setAccount', 'UA-35005816-1']);
            _gaq.push(['_trackPageview']);
            (function() {var ga = document.createElement('script');
                ga.type = 'text/javascript';
                ga.async = true;
                ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
                var s = document.getElementsByTagName('script')[0];
                s.parentNode.insertBefore(ga, s);
            })();
        </script>
    </head> 
    <body> 
        <a href="index.php" class="back">Αρχική σελίδα</a>
        <div id="main">
            <h1 id="heading">Εργασίες</h1> 
            <p> 
                Οι εργασίες δοκιμάζονται στον νεότερο <a href="http://www.mozilla.com/el/" class="firefox icon">Mozilla Firefox</a>, και πρέπει να κάνουν validate
                ως <a href="http://validator.w3.org/" title="Κάντε validation του HTML σας">XHTML 1.0 Strict</a> και
                <a href="http://jigsaw.w3.org/css-validator/" title="Κάντε validation του CSS σας">CSS 2.1 ή νεότερο</a>.
            </p> 
            <p class="note"> 
                Η παράδοση όλων των εργασιών είναι προϋπόθεση για την ολοκλήρωση του σεμιναρίου.
            </p> 
            <h2 id="assignment1">1η Εργασία <span>11/10/2010</span></h2>
            <p> 
                Δημιουργείστε μία <strong>προσωπική ιστοσελίδα</strong> που να περιλαμβάνει το <strong>όνομά</strong> σας,
                το <strong>επώνυμό</strong> σας, και το <strong>e-mail</strong> σας.
                Προσθέστε λίγα λόγια για τον εαυτό σας, μία φωτογραφία που σας αρέσει,
                μία λίστα, και έναν πίνακα της επιλογής σας.
            </p> 
            <h3>Παράδοση</h3>
            <p> 
                Μέσω e-mail στο <strong>web-seminar@softlab.ntua.gr</strong> με συνημμένο αρχείο .zip ή .html
            </p> 
            <h3>Ύλη</h3>
            <p>
                Διαλέξεις 1 και 2
            </p>
            <h3>Προθεσμία</h3>
            <p>Μέχρι <strong>18/10/2010</strong></p>
            <h3>Πρότυπες λύσεις</h3>
            <ul>
                <li><a href="resources/assignment1/solutions/makis/homepage.html">Μάκης Αρσένης</a></li>
                <li><a href="resources/assignment1/solutions/christine/site.html">Χριστίνα Τσικαλάκη</a></li>
                <li><a href="resources/assignment1/solutions/giorgos/site.html">Γιώργος Παυλάκος</a></li>
            </ul>
            <h2 id="assignment2">2η Εργασία <span>18/10/2010</span></h2>
            <p>
                Αυτή είναι μία κλασική εργασία που ανατίθεται σε όσους μαθαίνουν HTML και CSS. Ονομάζεται half <a href="http://en.wikipedia.org/wiki/Clean_room_design">cleanroom</a> επειδή δίνεται μόνο ο μισός κώδικας, ενώ ο υπόλοιπος μισός
                πρέπει να γραφτεί από εσάς.
            </p>
            <p>
                Ο <strong>βιρτουόζος</strong> σχεδιαστής ιστοσελίδων <strong>Μπάμπης Σιεσές</strong> σχεδίασε ένα εναλλακτικό design για την σελίδα 
                <a href="http://www.xkcd.com/">XKCD</a>, τη διάσημη σειρά comic. Δυστυχώς, όσο έλειπε από τον υπολογιστή του,
                η <strong>γάτα</strong> του πάτησε τα πλήκτρα <code>Shift + Del</code> με αποτέλεσμα το αρχείο CSS που είχε γράψει να εξαφανιστεί
                από προσώπου γης. Για καλή του τύχη, είχε κρατήσει ένα <strong>screenshot</strong> και έτσι θυμάται την εμφάνιση της σελίδας
                που είχε φτιάξει. Είχε επίσης σημειώσει τα χρώματα και τις γραμματοσειρές που χρησιμοποίησε. 
                Η δική σας δουλειά είναι να ξαναγράψετε το αρχείο CSS με βάση τα στοιχεία αυτά.
            </p>
            <p>
                Το αποτέλεσμα μετά την εφαρμογή του CSS θα πρέπει να φαίνεται πανομοιότυπο με την έκδοση που φαίνεται 
                στο screenshot.
            </p>
            <h3>Δίνονται</h3>
            <ul>
                <li><a href="resources/assignment2/sandwich.html">Το αρχείο HTML του Μπάμπη</a></li>
                <li><a href="resources/assignment2/sandwich.png">Η εικόνα του comic</a></li>
                <li><a href="resources/assignment2/menu.png">Η εικόνα φόντου που χρησιμοποίηθηκε</a></li>
                <li><a href="resources/assignment2/screenshot.png">Το screenshot που είχε τραβήξει</a></li>
                <li><a href="resources/assignment2/notes.png">Οι σημειώσεις του Μπάμπη</a></li>
            </ul>
            <h3>Παράδοση</h3>
            <p> 
                Μέσω FTP. Ανεβάστε το αρχείο style.css στον προσωπικό σας φάκελο.<br />
                FTP server: <strong>web-seminar.softlab.ntua.gr</strong><br />
                Τα <strong>FTP username</strong> και <strong>FTP password</strong> υπάρχουν στο προσωπικό σας dashboard.
            </p>
            <p>
                Για να ανεβάσετε αρχεία μέσω FTP θα χρειαστείτε ένα FTP client. Αυτό μπορεί να είναι οποιοδήποτε πρόγραμμα
                FTP client της επιλογής σας, όπως για παράδειγμα το <a href="http://filezilla-project.org/" class="filezilla icon">Filezilla</a> που είναι διαθέσιμο τόσο για Windows, όσο και για Linux.
            </p>
            <p>
                <strong><a href="resources/ftp">Οδηγίες χρήσης του FileZilla</a></strong>
            </p>
            <p>
                Για να δείτε και να αντιγράψετε τον κώδικα ενός HTML αρχείου μπορείτε να χρησιμοποιήσετε την λειτουργία
                Προβολή &gt; Πηγαίος κώδικας σελίδας (View &gt; Page source code) του φυλλομετρητή σας.
            </p>
            <h3>Πρόσβαση στο dashboard</h3>
            <p>
                Θα πρέπει να έχετε ήδη λάβει ένα e-mail στην διεύθυνση που δηλώσατε με 
                την παράδοση της 1ης 
                εργασίας. Το e-mail αυτό περιέχει έναν σύνδεσμο τον οποίο θα μπορείτε να χρησιμοποιήσετε μία φορά
                για να ορίσετε τον κωδικό πρόσβασης για το dashboard. Ενδέχεται το e-mail αυτό να έχει μεταφερθεί στον φάκελο
                "Ανεπιθύμητη Αλληλογραφία" ή "Spam", συνεπώς αν δεν το λάβατε, ρίξτε μία ματιά και εκεί.
            </p>
            <p>
                Το dashboard στο μέλλον θα περιέχει τις εργασίες που έχετε
                στείλει μέχρι τώρα και τις διορθώσεις των εργασιών σας. Αυτή τη στιγμή εκεί θα βρείτε το προσωπικό FTP username
                και το FTP password σας που θα χρησιμοποιήσετε για την παράδοση της 2ης εργασία. Το FTP password που λαμβάνετε
                δημιουργείται αυτόματα και είναι διαφορετικό από τον κωδικό πρόσβασης για το dashboard που ορίζετε εσείς.
                Αυτό γίνεται για την προστασία του κωδικού σας, αφού το FTP είναι ένα σύστημα από τη φύση του ανασφαλές.
            </p>
            <h3>Ύλη</h3>
            <p>
                Διαλέξεις μέχρι και την 4η
            </p>
            <h3>Προθεσμία</h3>
            <p>Μέχρι <strong>25/10/2010</strong></p>
            <h3>Πρότυπη λύση</h3>
            <p><a href="resources/assignment2/solution/manda-go/style.css">Μαρία Γκολιομύτη</a></p>
			<h2 id="assignment3">3η Εργασία <span>25/10/2010</span></h2>
            <p>
                Μετά το half cleanroom της δεύτερης εργασίας αυτή τη φορά έχετε να κάνετε ένα πλήρες cleanroom. Ο στόχος αυτής της εργασίας χωρίζεται
				σε δύο στάδια. Στο πρώτο στάδιο θα πρέπει να περιγράψετε με σωστό σημασιολογικά τρόπο το έγγραφο που βλέπετε στο screenshot. Στο δεύτερο
				στάδιο θα πρέπει να γράψετε τους κανόνες CSS που θα εφαρμοστούν στο έγγραφο που θα φτιάξετε και θα το κάνουν να φαίνεται όπως και στο
				screenshot.
            </p>
            <p>
                Το αποτέλεσμα μετά την εφαρμογή του CSS θα πρέπει να είναι ποιοτικά ίδιο με την έκδοση του screenshot. Αυτό σημαίνει ότι δεν είναι απαραίτητο
				να κάνετε ακριβείς μετρήσεις για τις αποστάσεις κλπ.
            </p>
			<h3>Tip</h3>
			<p>
				Προσπαθήστε να φτιάξετε το γενικό layout με άδεια <code>divs</code> και ύστερα προσθέστε σε αυτά το περιεχόμενό σας.
			</p>
            <h3>Δίνονται</h3>
            <ul>
                <li><a href="resources/assignment3/zen/zen.png">Η εικόνα που χρησιμοποίηθηκε</a></li>
                <li><a href="resources/assignment3/screenshot.png">Το screenshot της σελίδας</a></li>
                <li><a href="resources/assignment3/notes.png">Οι σημειώσεις</a></li>
                <li><a href="resources/assignment3/knight.txt">Το κείμενο</a></li>
            </ul>
            <h3>Ύλη</h3>
            <p>
                Διαλέξεις μέχρι και την 6η
            </p>
            <h3>Παράδοση</h3>
            <p> 
                Μέσω FTP. Ανεβάστε το αρχείο index.html και style.css στον φάκελο assignment3 που βρίσκεται μέσα στον προσωπικό σας φάκελο.<br />
                FTP server: <strong>web-seminar.softlab.ntua.gr</strong><br />
                Τα <strong>FTP username</strong> και <strong>FTP password</strong> υπάρχουν στο προσωπικό σας dashboard.
            </p>
            <h3>Προθεσμία</h3>
            <p>Μέχρι <strong>15/11/2010</strong></p>
            <p>Λόγω της καθυστέρησης ανάρτησης της 6ης video-διάλεξης, δόθηκε παράταση μίας εβδομάδας για την 3η εργασία.</p>
            <h3>Πρότυπη λύση</h3>
            <p><a href="resources/assignment3/rigas">Ρήγας Παπαθανασόπουλος</a></p>
            <h2 id="assignment4">4η Εργασία <span>8/11/2010</span></h2>
            <p>
                Αυτή η εργασία αφορά μία πρακτική χρήση της PHP. Ο σκοπός της είναι να δείτε πώς η PHP
                χρησιμεύει για να δημιουργούμε σελίδες που είναι δυναμικές και έχουν περισσότερες δυνατότητες
                από μία στατική σελίδα.
            </p>
            <p>
                Ζητείται να κατασκευάσετε μία <strong>απλή</strong> σελίδα για ανέβασμα αρχείων. Θα πρέπει να παρέχει
                τις ακόλουθες δυνατότητες:
            </p>
            <ul>
                <li>Ανέβασμα αρχείων</li>
                <li>Προβολή λίστας ανεβασμένων αρχείων</li>
                <li>Κατέβασμα ανεβασμένων αρχείων</li>
            </ul>
            <p>
                Επιμένουμε η ασκηση να παραμείνει <strong>απλή</strong>:
            </p>
            <ul>
                <li>Δεν χρειάζεται να υπάρχουν χρήστες</li>
                <li>Τα αρχεία δεν χρειάζεται να αποθηκεύονται σε κάποια βάση δεδομένων. Απλώς στον φάκελο.</li>
                <li>Ο καθένας μπορεί να κατεβάσει τα αρχεία από οποιονδήποτε</li>
                <li>Δεν χρειάζονται πολλές σελίδες. Μία σελίδα με μία λίστα από ανεβασμένα αρχεία και μία φόρμα είναι αρκετά.</li>
            </ul>
            <p>
                Επειδή ο browser δεν τρέχει PHP, αλλά αυτή τρέχει στον HTTP server, θα πρέπει να έχετε ένα μηχάνημα
                server όπου θα δοκιμάσετε τον κώδικά σας. Μπορείτε να κάνετε τον υπολογιστή σας server με εγκατάσταση
                του Apache και της PHP.
            </p>
            <p>
                <strong><a href="resources/apachephp/setup.html">Οδηγίες εγκατάστασης Apache και PHP</a></strong>
            </p>
            <p>
                Είστε ελεύθεροι να σχεδιάσετε σε HTML/CSS την διεπαφή χρήστη που εσείς θέλετε. Μπορείτε να χρησιμοποιήσετε
                οτιδήποτε από HTML και CSS. Παρ' όλο που ο σκοπός της άσκησης δεν είναι η εξάσκηση σε HTML/CSS, τα αρχεία
                σας θα πρέπει να κάνουν validate.
            </p>
            <p>
                Μία λύση για τον χωρισμό των PHP αρχείων είναι να έχετε 2 PHP αρχεία: Το πρώτο που θα τυπώνει την λίστα 
                με τα υπάρχοντα αρχεία και μία φόρμα, και το δεύτερο το οποίο θα είναι το action της φόρμας για το 
                ανέβασμα του αρχείου και το οποίο απλώς θα αποθηκεύει το αρχείο και θα επιστρέφει τον χρήστη στην προηγούμενη
                σελίδα.
            </p>
            <p>
                Η αποθήκευση των αρχείων από την μεριά του server, θα ήταν σκόπιμο να γίνεται σε έναν φάκελο όπου θα βρίσκονται
                όλα τα αρχεία που ανεβαίνουν. Για παράδειγμα, σε ένα σύστημα Windows αυτό θα μπορούσε να είναι το C:/Uploads,
                ενώ σε ένα σύστημα Linux ή Mac θα μπορούσε να είναι το /home/uploads. Προσέξτε ο HTTP server να έχει δικαιώματα
                εγγραφής στους συγκεκριμένους φακέλους.
            </p>
            <h3>Ύλη</h3>
            <p>
                Διαλέξεις μέχρι και την 9η
            </p>
            <h3>Παράδοση</h3>
            <p> 
                Μέσω SSH/SCP. Ανεβάστε τα αρχεία σας στον προσωπικό σας φάκελο. Ο προσωπικός σας φάκελος βρίσκεται στο
                <code>/home/students/username</code> όπου <code>username</code> είναι το όνομα χρήστη που έχετε χρησιμοποιήσει
                και στις προηγούμενες εργασίες.<br />
                SSH server: <strong>web-seminar.softlab.ntua.gr</strong><br />
                Τα <strong>SSH username</strong> και <strong>SSH password</strong> υπάρχουν στο προσωπικό σας dashboard
                και είναι τα ίδια με τα FTP username και FTP passwords σας.
            </p>
            <p>
                <strong><a href="resources/scp">Οδηγίες χρήσης SCP</a></strong>
            </p>
            <h3>Προθεσμία</h3>
            <p>Μέχρι <strong>22/11/2010</strong>. Μπορείτε να την παραδόσετε και αργότερα μαζί με την 5η εργασία.</p>
            <h3>Πρότυπη λύση</h3>
            <p><a href="#assignment6">Βλέπε 6η εργασία</a></p>
            <h2 id="assignment5">5η Εργασία <span>22/11/2010</span></h2>
            <p>
                Αυτή η εργασία αφορά βελτίωση της 4ης εργασίας. Σε περίπτωση που δεν έχετε ολοκληρώσει την 4η εργασία,
                σας προτείνουμε να τελειώσετε πρώτα τις απαιτήσεις της 4ης εργασίας πριν προχωρήσετε.
            </p>
            <p>
                Ζητείται να προσθέσετε τις ακόλουθες δυνατότητες στο σύστημα του file uploader που έχετε κατασκευάσει:
            </p>
            <ul>
                <li>Δημιουργία <strong>λογαριασμού χρήστη</strong></li>
                <li><strong>Login / Logout</strong></li>
                <li>Αποθήκευση <strong>χρηστών</strong> στην βάση δεδομένων</li>
                <li>Αποθήκευση meta-πληροφοριών <strong>αρχείων</strong> στη βάση δεδομένων</li>
                <li>Αποθήκευση χρήστη που ανέβασε κάθε αρχείο</li>
                <li>Εμφάνιση ονόματος χρήστη στην λίστα των αρχείων</li>
                <li>Όλοι οι χρήστες μπορούν να κατεβάσουν τα αρχεία όλων</li>
            </ul>
            <p>
                Θα χρειαστείτε μία εγκατάσταση της <strong>MySQL</strong> και του <strong>phpMyAdmin</strong>.
            </p>
            <p>
                <strong><a href="resources/mysql">Οδηγίες εγκατάστασης MySQL</a></strong>
			</p>
			<p>
				<strong><a href="resources/phpmyadmin">Οδηγίες εγκατάστασης phpMyAdmin</a></strong>
            </p>
            <p>
                Για την διαχείριση της εισόδου των χρηστών, μπορείτε να επιλέξετε να χρησιμοποιήσετε δικά σας <strong>μπισκότα</strong>, ή να κάνετε χρήση της έτοιμης λειτουργίας <strong>συνόδων της PHP</strong>.
            </p>
            <p>
                Είναι καλό να ξοδέψετε κάποιο χρόνο για να σκεφτείτε ένα εύχρηστο <strong>σχήμα</strong> για την βάση δεδομένων σας.
                Αν το σχήμα σας δεν είναι καλοσχεδιασμένο, ενδέχεται να χάσετε αρκετό χρόνο στο να ξαναγράψετε τον κώδικά
                σας αν επιθυμείτε αργότερα να το αλλάξετε.
            </p>
            <p>
                Στην παράδοση της εργασίας σας, συμπεριλάβετε ένα αρχείο κειμένου .sql που θα περιέχει τα ερωτήματα SQL
                που αφορούν την δημιουργία του σχήματος (δηλαδή <code>CREATE TABLE</code>).
                Μπορείτε να τα πάρετε έτοιμα <strong>με την λειτουργία "Export" του phpMyAdmin</strong>.
            </p>
            <h3>Ύλη</h3>
            <p>
                Διαλέξεις μέχρι και την 12η
            </p>
            <h3>Παράδοση</h3>
            <p> 
                Όπως και η 4η εργασία.
            </p>
            <h3>Προθεσμία</h3>
            <p>Μέχρι <strong>6/12/2010</strong></p>
            <h3>Πρότυπη λύση</h3>
            <p><a href="#assignment6">Βλέπε 6η εργασία</a></p>
            <h2 id="assignment6">6η Εργασία <span>7/12/2010</span></h2>
            <p>
                Αυτή η εργασία αφορά βελτίωση της 5ης εργασίας. Σε περίπτωση που δεν έχετε ολοκληρώσει την 5η εργασία,
                σας προτείνουμε να τελειώσετε πρώτα τις απαιτήσεις της 5ης εργασίας πριν προχωρήσετε.
            </p>
            <p>
                Ζητείται να προσθέσετε την δυνατότητα "άμεσης προβολής" στο σύστημα του file uploader 
                που έχετε κατασκευάσει. Αυτό σημαίνει ότι στην λίστα με τα αρχεία που μπορεί να κατεβάσει κανείς,
                θα πρέπει να μπορεί να κάνει κλικ σε κάποιο αρχείο για να προβάλλει τα περιεχόμενά του. Αυτή
                η προεπισκόπηση θα πρέπει να δουλεύει σε εικόνες και αρχεία κειμένου. Στη συνέχεια, αν επιθυμεί,
                θα πρέπει να δίνεται η δυνατότητα κανονικής λήψης του αρχείου. Η δυνατότητα αυτή θα πρέπει να
                δίνεται και στα αρχεία άλλων ειδών για τα οποία η προεπισκόπηση δεν είναι δυνατή.
            </p>
            <p>
                Πατώντας κανείς πάνω στο όνομα ενός αρχείου, θα πρέπει να βλέπει την προεπισκόπηση, που για κείμενα
                θα περιλαμβάνει το ίδιο το κείμενο, ενώ για εικόνες την ίδια την εικόνα, καθώς και ένα σύνδεσμο
                για πλήρη λήψη του αρχείου. Πατώντας ξανά, θα πρέπει να μπορεί να κρύβει την προεπισκόπηση. Στα
                αρχεία όπου η προεπισκόπηση δεν είναι εφικτή, θα πρέπει το ένα κλικ να οδηγεί σε κανονική λήψη 
                του αρχείου.
            </p>
            <p>
                Απαιτείται το περιεχόμενο από τα αρχεία κειμένου των οποίων γίνεται η προεπισκόπηση να 
                <strong>μην</strong> περιλαμβάνονται στην ίδια τη σελίδα, αλλά να κατεβαίνει με την χρήση 
                AJAX. Αυτό σημαίνει ότι θα χρειαστείτε κάποια ένδειξη φόρτωσης (π.χ. "Γίνεται λήψη του αρχείου...") 
                έως ότου εμφανίσετε το περιεχόμενο μέσα στην ίδια την σελίδα. Φροντίστε να μην γίνεται ξανά
                φόρτωση της σελίδας, αλλά το περιεχόμενο να εμφανίζεται χωρίς refresh.
            </p>
            <h3>Ύλη</h3>
            <p>
                Διαλέξεις μέχρι και την 16η
            </p>
            <h3>Παράδοση</h3>
            <p>
                Με SCP.
            </p>
            <h3>Προθεσμία</h3>
            <p>
                Μέχρι <strong>21/12/2010</strong>
            </p>
            <p>
                Η προθεσμία της 6ης εργασίας παρατείνεται μέχρι το τέλος το 2010, καθώς το video της 16ης διάλεξης δεν είναι ακόμη διαθέσιμο.
            </p>
            <p><strong>Καθώς η 5η και η 6η εργασία αποτελούν βελτίωση της 4ης εργασίας, οι ημερομηνίες παράδοσης
                       της 4ης και της 5ης εργασίας είναι ενδεικτικές και όχι δεσμευτικές.</strong></p>
            <h3>Πρότυπη λύση</h3>
            <p><a href="resources/assignment6/solutions/kylelb.zip">Σωκράτης Βίδρος</a></p>
            <h2 id="assignmentfinal">Τελική εργασία <span>20/12/2010</span></h2>
            <h3>Ομαδική δουλειά</h3>
            <p>
                Η τελική εργασία θα απαιτεί την συνεργασία <strong>σε ομάδες των 3 ατόμων</strong>
                (ή περισσότερων αν το επιθυμείτε).
                Τα άτομα θα είναι της επιλογής σας. Θα πρέπει να αποφασίσετε την ομάδα με την οποία θα δουλέψετε
                μέσα στις επόμενες ημέρες. Μπορείτε αν θέλετε να συνεργαστείτε μέσω SVN ή git.
            </p>
            <h3>Θέμα</h3>
            <p>
                Το θέμα της τελικής εργασίας θα είναι της επιλογής σας, ενώ ακολουθούν αρκετά προτεινόμενα θέματα. 
                
                Η τελική εργασία αφορά την 
                ανάπτυξη μίας μικρής αλλά πλήρους web εφαρμογής. 
                Αν έχετε μία καλή ιδέα και την αναπτύξετε, θα θέλαμε να την εξελίξετε σε
                μία πραγματική ολοκληρωμένη και χρήσιμη υπηρεσία μετά το τέλος του σεμιναρίου.
                Ελπίζουμε 1 - 2 ιδέες που θα αναπτυχθούν μέσα από το σεμινάριο να εξελιχθούν σε πραγματικές
                υπηρεσίες που θα είναι χρήσιμες για τον κόσμο, θα γίνουν γνωστές, και θα χρησιμοποιηθούν
                από ευρύ κοινό. Θα έχετε κάθε υποστήριξή μας γι' αυτό το σκοπό.
            </p>
            <h3>Προτεινόμενα Θέματα</h3>
            <ul>
                <li><strong>Σελίδα τύπου Twitter:</strong> Κάθε χρήστης βλέπει μία λίστα με τα status updates που αναρτούν τα άτομα που "ακολουθεί".</li>
                <li><strong>Forum:</strong> Χρήστες, topics, και αναρτήσεις σε κάθε topic.</li>
                <li><strong>Ιστολόγιο:</strong> Κάθε χρήστης μπορεί να δημιουργήσει το δικό του blog, με αναρτήσεις και σχόλια σε κάθε ανάρτηση.</li>
                <li><strong>Εικονολόγιο:</strong> Δυνατότητα σε κάθε χρήστη να ανεβάσει τις φωτογραφίες του και να τις μοιραστεί με τους φίλους του.</li>
                <li><strong>Αγγελίες:</strong> Σελίδα αγγελιών όπου κάθε μέλος μπορεί να δει τις αγγελίες των άλλων και να αναρτήσει τις δικές του.</li>
                <li><strong>Ερωτοαπαντήσεις:</strong> Σελίδα όπου μπορεί κανείς να αναρτήσει κάποια ερώτηση και να περιμένει απαντήσεις.</li>
                <li><strong>Συλλογή αγαπημένων:</strong> Κάθε χρήστης έχει μία συλλογή από αγαπημένες ιστοσελίδες τις οποίες μπορεί να μοιραστεί με τους φίλους του.</li>
            </ul>
            <p>
                Θα προτιμούσαμε να σκεφτείτε εσείς ένα αυθεντικό θέμα και να το υλοποιήσετε, και να 
                χρησιμοποιήσετε τα παραπάνω μόνο σαν πρωταρχικές ιδέες. Αν έχετε κάποια μεγάλη ιδέα,
                προσπαθήστε να υλοποιήσετε μία πλήρη και λειτουργική εφαρμογή που να κάνει κάποια πράγματα
                από αυτά που φαντάζεστε ώστε να προλάβετε να την παρουσιάσετε μετά τα Χριστούγεννα.
                Στη συνέχεια θα έχετε την ευκαιρία να την βελτιώσετε πέρα από τα πλαίσια του σεμιναρίου
                αν σας αρέσει.
            </p>
            <h3>Hosting</h3>
            <p>
                Αν θέλετε να αναπτύξετε μία πραγματική υπηρεσία θα χρειαστείτε ένα domain name και 
                μία υπηρεσία hosting. Αυτά προσφέρονται από διάφορες εταιρίες, για παράδειγμα από το
                <a href="http://www.papaki.gr/">papaki</a> σε τιμές κάτω από 5€ / μήνα.
                Έτσι θα μπορείτε να έχετε το δικό σας 
                domain name (π.χ. example.com) και να έχουν πρόσβαση στην εφαρμογή σας όλοι. Θα χαρούμε
                να δούμε την εφαρμογή σας ολοκληρωμένη και διαθέσιμη online, και φυσικά να την χρησιμοποιήσουμε.
            </p>
            <h3>Παρουσίαση</h3>
            <p>
                Οι καλύτερες τελικές εργασίες που θα επιλεγούν θα παρουσιαστούν από τους δημιουργούς τους 
                σε μία διάλεξη αφιερωμένη σε αυτό το σκοπό που θα διοργανωθεί μετά το τέλος του σεμιναρίου.
                Θα αφιερώσουμε 10 - 15 λεπτά σε κάθε παρουσίαση.
            </p>
            <h3>Ύλη</h3>
            <p>
                Τα πάντα! Νιώστε ελεύθεροι/ες να εμβαθύνετε στις τεχνολογίες που έχουμε δείξει, ακολουθώντας
                τις αρχές που σας δείξαμε, αλλά χωρίς να περιορίζεστε στα πλαίσια του σεμιναρίου. Ανάλογα
                με τον τύπο της εφαρμογής σας, ενδέχεται να χρειαστεί να εμβαθύνετε σε κάποια διαφορετική
                τεχνολογία.
            </p>
            <h3>Παράδοση</h3>
            <p>
                Αρχικά δημιουργήστε όλοι ένα δημόσιο/ιδιωτικό RSA κλειδί για τον λογαριασμό σας. Αυτό θα σας 
                επιτρέψει την χρήση του SCP χωρίς κωδικό πρόσβασης.
            </p>
            <p>
                <a href="resources/rsa">Οδηγίες δημιουργίας RSA κλειδιού</a>
            </p>
            <p>
                Επιλέξτε <strong>έναν</strong> από τους συνεργάτες σας στην ομάδα για να παραδόσει την εργασία.
                Η παράδοση της εργασίας θα γίνει σε 2 φάσεις. Αρχικά, θα πρέπει να παραδόσετε μία πρώτη αλλά
                λειτουργική έκδοση της εργασίας σας. Αυτό θα πρέπει να γίνει μέχρι τις 8 Ιανουαρίου, ώστε να
                έχουμε χρόνο να τις αξιολογήσουμε και να επιλέξουμε αυτές που θα παρουσιαστούν.
            </p>
            <p>
                Μέχρι τις 8 Ιανουαρίου, ο συνεργάτης σας που αποφασίσατε ότι θα στείλει την εργασία θα πρέπει
                να την ανεβάσει μέσω SCP και χρησιμοποιώντας RSA στον φάκελο "final" που θα δημιουργήσει. Εκεί
                θα πρέπει να υπάρχει ο πλήρης κώδικας της εφαρμογής.
            </p>
            <p>
                Επιπλέον, θα πρέπει να μας στείλετε ένα e-mail ανά ομάδα στο web-seminar@softlab.ntua.gr το οποίο θα
                περιλαμβάνει:
            </p>
            <ul>
                <li>Ένα link ώστε να δούμε την τελική σας εργασία να τρέχει στον server σας.</li>
                <li>Το username του συνεργάτη σας που έχει ανεβάσει τον κώδικα της εργασίας.</li>
            </ul>
            <p>
                Μέχρι τις 23 Ιανουαρίου, θα έχετε την δυνατότητα να βελτιώσετε τις εργασίες σας
                περαιτέρω. Οι καλύετερες τελικές εργασίες θα παρουσιαστούν μπροστά στους υπόλοιπους
                συμμετέχοντες στο αμφιθέατρο στις 28 Ιανουαρίου.
            </p>
            <h3>Προθεσμία</h3>
            <p>
                Παράδοση μέχρι <strong>8/1/2011</strong> όπου και θα αποφασίσουμε για τις καλύτερες.
                Παρουσίαση στις 28 Ιανουαρίου 2011. Μέχρι τότε μπορείτε να τις βελτιώσετε κι άλλο.
            </p>
            
            <h2>Δημοσίευση εργασιών</h2>
            <p>
                Μία από τις λύσεις που στάλθηκαν για κάθε εκφώνηση δημοσιευθεύθηκε ως πρότυπη λύση μετά την προθεσμία κάθε
                εργασίας.
            </p>
            <p>
                Επιτρέπεται και ενθαρρύνεται η συνεργασία. Αν το επιθυμείτε, μπορείτε να χρησιμοποιήσετε και τεχνολογίες
                εκτός ύλης, όμως οι πρότυπες εργασίες που θα επιλεγούν και θα δημοσιευθούν στη σελίδα του μαθήματος 
                πρέπει να βασίζονται μόνο σε στοιχεία που έχουν παρουσιαστεί μέσα στις παραδόσεις, και να κάνουν ορθή
                χρήση των τεχνολογιών.
            </p>
            <p>
                Το κριτήριο επιλογής για την δημοσίευση της κάθε εργασίας ήταν η εκπαιδευτική αξία της. Αυτό σημαίνει ότι
                κώδικας ο οποίος είναι πιο ευανάγνωστος και κατανοητός προτιμήθηκε, ώστε διαβάζοντάς τον να μπορούν 
                και οι υπόλοιποι να μάθουν κάτι. Επίσης μας αρέσουν οι πρωτότυπες και δημιουργικές λύσεις.
            </p>
        </div>
    </body> 
</html> 
