        <div class="dim"></div>
        <div class="modal">
            <h2>Τυπικά θέματα</h2>
            <a href='' class='back'>&times;</a>
            <p>
                Το σεμινάριο ήταν ένας κύκλος παρουσιάσεων που διοργανώνεται από τους προπτυχιακούς φοιτητές Ηλεκτρολόγους Μηχανικούς και Μηχανικούς Υπολογιστών <a href='http://dionyziz.com/'><strong>Διονύση Ζήνδρο</strong></a> και <a href='http://twitter.com/#!/petrosagg'><strong>Πέτρο Αγγελάτο</strong></a>.
            </p>
            <p>
                Ολόκληρο το υλικό του σεμιναρίου, μεταξύ άλλων η ιστοσελίδα αυτή, οι βιντεοσκοπημένες διαλέξεις, και οι διαφάνειες, διατίθενται υπό την άδεια Creative Commons 3.0 Attribution. Οι τεχνολογίες που παρουσιάστηκαν στο σεμινάριο είναι αποκλειστικά τεχνολογίες ανοιχτού κώδικα, και ακολουθούμε ανοιχτά πρότυπα.
            </p>
            <p>
                Η βιντεοσκόπηση και το post-processing έγινε από τους φοιτητές <a href="http://twitter.com/#!/renelvon">Νικόλα Κορασίδη</a> και <a href="http://twitter.com/#!/pariskasid">Πάρι Κασιδιάρη</a>. 
            </p>
            <p>
                Οι φωτογραφίες και τα εικονίδια είναι των καλλιτεχνών <a href='http://www.flickr.com/people/szili/'>Szakács Szilárd</a>, <a href="http://www.flickr.com/people/ratanx/">Ratan X</a> και της εταιρίας <a href='http://www.defaulticon.com/'>Interactivemania</a>. Ο σχεδιασμός της σελίδας είναι του Πέτρου Αγγελάτου και Διονύση Ζήνδρου. Τμήμα του σχεδιασμού έγινε από τον <a href="http://themis.logimus.com/">Θέμη Παπαμελετίου</a>. Όλο το υλικό χρησιμοποιείται με άδεια.
            </p>
            <p>
                Ευχαριστούμε τους καθηγητές του <a href='http://softlab.ntua.gr/'>Εργαστηρίου Λογισμικού</a> κκ. <a href="http://www.softlab.ntua.gr/~fotakis/">Δημήτρη Φωτάκη</a>, <a href="http://www.softlab.ntua.gr/~nickie/">Νίκο Παπασπύρου</a>, και Κωστή Σαγώνα για την αμέριστη υποστήριξή τους, και τον πρόεδρο της σχολής Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών κ. Ανδρέα Σταφυλοπάτη. H δραστηριότητα διεξάγεται με την συνδρομή της σχολής σε χώρο που έχει παραχωρηθεί από τη Σχολή.
            </p>
            <p>
                Το σεμινάριο διοργανώθηκε ανεξάρτητα, από προπτυχιακούς φοιτητές και όχι από μέλη ΔΕΠ του ΕΜΠ, και είναι ανεπίσημη φοιτητική δραστηριότητα. Η σχολή δεν φέρει ευθύνη για το περιεχόμενο του σεμιναρίου, και αυτό δεν εντάσσεται στο διδακτικό πρόγραμμα της σχολής. Το σεμινάριο δεν είναι αναγνωρισμένο από το κράτος ή οποιαδήποτε ακαδημαϊκή κοινότητα.
            </p>
            <p class="license">
                <img src='http://i.creativecommons.org/l/by/3.0/88x31.png' alt='Creative Commons 3.0 Attribution' />
            </p>
        </div>
